{"1":{
    "doctype": "trope",
    "links": [ 
		{
			"genre": "Anime & Manga", 
			"listoftitles":[
				{
					"titleofwork": "Kyo Kara Maoh!", 
					"link": "http://tvtropes.org/pmwiki/pmwiki.php/LightNovel/KyoKaraMaoh"
					},
					{
						"titleofwork": "One Piece",
						"link": "http://tvtropes.org/pmwiki/pmwiki.php/Manga/OnePiece"
					}
					]
				},
				{
					"genre": "Comic Books",
					"listoftitles":[
						{
							"titleofwork":"Donald Duck",
							"link":"http://tvtropes.org/pmwiki/pmwiki.php/WesternAnimation/DonaldDuck"},
						{
							"titleofwork":"Justice League",
							"link":"http://tvtropes.org/pmwiki/pmwiki.php/Franchise/JusticeLeagueOfAmerica"
						}
			    ]
			}
			],
    "text": "\n\nMaybe there's a reason Beast Boy gets hypnotized so often.\nLisa: Watch yourself, Dad - you're the highly suggestible type. Homer: Yes, I am the highly suggestible type.\n— The Simpsons\n\nHeroes and willpower go together like bread and butter. She may be a Determinator with Heroic Resolve or Heroic Willpower, even perhaps capable of Fighting from the Inside to shake off Mind Control.\nThen there's characters who just need an amateur hypnotist with a bit of twine and a bottle cap to be hopelessly under their control. These characters are Weak-Willed. They may be just as confident and resolute as anyone else, but they have absolutely no defense (or maybe a negative defense, if such a thing is possible) to mind control.\nIt's not just against mundane party game hypnotism, but also brainwashing or Psychic Powers. The Jedi Mind Trick can leave them in a day long haze, and Charm Person will make them lifelong love slaves. At times, they may boast they have an iron resolve that can't be broken, before being comically \"switched on\" to Minion or The Renfield just by glancing at the goofy swirly eyes. Their new master may even be unsettled by how readily they took to the conditioning. This type of character also faces the Power Perversion Potential of having sex without giving conscious consent — which, for those of you following along at home, is a form of rape.\nA common variant is the \"easily suggestible\". Their weakness to brainwashing stems from a chronic wishy-washiness; if they're incapable of putting up resistance to mundane used car salesmen, how can they hope to fight off Hypnotic Eyes?\nTruth in Television to a certain extent, since some people are more susceptible to hypnosis than others. But in Real Life, \"highly suggestible\" means about as susceptible to hypnosis as the average TV character is, since hypnosis is a lot less powerful than it's made out to be. But also interestingly inverted in Real Life, as hypnotizability is actually positively correlated with higher intelligence. (Many of the mental characteristics that allow hypnosis to work, such as attention span, imagination, mental flexibility, and understanding of language and concepts, are more prevalent in the more intelligent. People with IQs below 80 are often considered effectively \"unhypnotizable\".)\nIf it's a friend rather than an enemy doing the hypnosis, expect it to devolve in Pygmalion Snapback or Teach Him Anger. Compare Extreme Doormat and Empty Shell.\n\nExamples\n    open/close all folders  \n    Anime & Manga \n One Piece's Monkey D. Luffy is so suggestible that the hypnotism doesn't even have to be aimed at him. He was hypnotized by a chakram on a string from over a hundred feet away, when the guy doing the hypnotizing was trying to hypnotize his underlings, not Luffy, and was surrounded by so many people that Luffy should barely have been able to see the chakram, let alone concentrate on it hard enough to be hypnotized. This is especially interesting when you realize that he's a Determinator with one of the strongest wills and most stubborn mindsets in the series. He's just really easily hypnotized. Of course, he's also the quintessential Idiot Hero, and the Rule of Funny always applies. Of course that hypnosis made him much, much stronger. So maybe he wanted to take advantage of the enemies' techniques. Or, he really is that suggestible, considering earlier he fell asleep just by looking at the chakram. Also notable is that the first hypnotist we see in the series is almost as susceptible to his own hypnotism powers as Luffy is. Later subverted, when his stolen shadow resists the villain's control for quite a long time, while normal people's succumb instantly and all of his comrades only resist on some very strict principles they have, being submissive otherwise.\n There's Jun Yamamoto from Special A, who is so weak-willed that when he was younger,  he got hypnotized by a TV program, of all things, resulting in his Depraved Bisexual Split Personality. No, really.\n Gilbert from Pandora Hearts has been brainwashed multiple times as a kid, as a grown up and in his past life. It's a wonder how he's able to keep Oz alive.\n Wolfram from Kyo Kara Maoh! is subjected to this. Justified though because  the key to unlocking the greatest evil in the demon world is his heart and as the series goes on and the seal to the great evil weakens, he starts zoning out more often than not.\n\n    Comic Books \n Superman\n Superman has a rather undeserved reputation as this, due to the frequency with which people brainwash him. It's not as though he's exactly weak-willed, and in fact often breaks out or at least partially resists their control himself. It's just that he's such an attractive target for brainwashing that it happens a lot. And it's also one of the few holes in his otherwise-invulnerable powers. While he's not weak-willed, his lack of any special protection against mind-control or magic makes it seem like a glaring weakness compared to his other capabilities (and, well, relatively speaking, it is).\n Despite her very strong personality, Lois Lane is surprisingly vunerable to hypnosis, at least in the Golden Age, with a tendency to fall very quickly and very easily into a trance. In 1940/41 alone she was hypnotized in five different stories.\n The Squadron Supreme, a Captain Ersatz of the Justice League who existed to job to Marvel heroes, were retconned to be Weak Willed due to their universe's absence of mind-controllers, in order to justify the way they were mind-controlled in every single one of their encounters with the mainstream Marvel heroes.\n Donald Duck in the comics is prone to boasting he's immune to hypnosis and subsequently being extremely easily hypnotized. In one story by Carl Barks he was even hypnotized by a children's toy he only imagined to have the power to do so. In another by Don Rosa, he fell asleep immediately as soon as the hypnotist started speaking about sleepiness.\n Actually used as an advantage in an issue of Justice League Europe in which The Flash (Wally West) is the weakest-willed member of the team, and therefore he's the only one who's able to pick up an extremely weak telepathic distress call from another dimension.\n\n    Films — Live-Action \n Star Wars: The original Jedi Mind Trick only works on \"the weak-minded\". This means sometimes it works and sometimes you're going to hear \"mind tricks don't work on me -- only money.\"\n In one of the Abbott and Costello films, a psychologist tries to hypnotize Lou Costello. Lou proves to be completely immune, but the psychologist accidentally hypnotizes himself. Then Lou wakes him up, and managed to accidentally hypnotizes him again mere seconds later.\n Mina Harker in Francis Ford Coppola's Dracula. It seems all you have to do is wave your hand in front of her face and she's in a trance.\n\n    Gamebooks \n In the Lone Wolf world, it concerns not individual but whole species. Although creatures with a resistance to Psychic Powers are much more common, some other like the Kwaraz giant lizards or the Akataz warhounds are very susceptible. This makes psychic attacks twice as efficient on them, or animal control powers work more easily.\n\n    Literature \n The entire Cavewight race has this problem in the Chronicles of Thomas Covenant. Combined with the fact that they're physically large and powerful, this got them warped by the Big Bad from a race of peaceful miners into his Ax-Crazy shock troops.\n Harry Potter:\n The Imperius Curse works this way; it will enslave the weak-willed to do the caster's bidding. In this case, however, it also depends on the intention behind the caster, because if they don't mean it, it will be easier to break the curse. It's probably more accurate to say that it affects anyone who's not strong-willed; Harry was the only one out of his entire class able to throw it off (with difficulty).\n Ron falls under this trope — he seems to fall under Veela magic more easily than the average guy (even a quarter-Veela is enough to affect him), was the easiest for Voldemort's locket to manipulate (granted, he had the most insecurities that could be exploited), and when Imperiused by Moody was actually still partially affected at the end of class (he couldn't stop skipping for a while). A Cheering Charm is known to cause the victim to break into a laughing fit when overdone, but it should be taken into consideration that the said victim was him.\n Artemis Fowl is mesmerized more easily and more frequently than any other character in the series. It is not completely clear whether this is really a case of this trope; the only human known to have even partially resisted the mesmer is  Butler, who is extremely strong-willed by anyone's standards. Also, while Artemis usually outmaneuvers enemies rather than beating them through sheer force of personality, he does show great self-control and strength of character on other occasions. Also, he never tries to resist. It isn't physically good for your brain to, so he either plans to eliminate the possibility of being mesmerized or accepts that he will be and plans around it.\n In The Lunar Chronicles Lunar guards are chosen for their weak lunar gift and wills, enabling thaumaturges to use groups of them as People Puppets. This also means that if there isn't a thaumaturge around any random group of lunar citizens can overpower a squad of guards if they can work up the nerve to try.\n\n    Live-Action TV \n In The Dick Van Dyke Show Rob was hypnotized into acting drunk when he heard a bell; but the subject of the hypnosis was Buddy, not Rob, and he wasn't even in the room when the hypnosis happened.\n Star Trek: Voyager (\"Spirit Folk\"). The Doctor is being held prisoner by the inhabitants of a holodeck program left on too long, who were weirded out by the crew coming and going like ghosts. To get some answers, someone suggests they try hypnosis on him. Being an A.I. Hologram himself, he dismisses it as childish... and he promptly gets completely hypnotized. Not to mention how he's reprogrammed into becoming evil at the push of a button in \"Equinox\".\n Doctor Who:\n Ben succumbs to hypnosis that has no effect on other characters in both \"The War Machines\" and \"The Macra Terror\". In the latter story, the Doctor doesn't even seem to care that much, and repeatedly informs the other characters that Ben 'can't help it'. This may be because of his military background, since he's often shown to become irritated if he's not getting authoritative orders.\n Jo, in her first appearance, is hopelessly mesmerised by the Master. Growing out of it is a major part of her Character Development, and in the final appearance of that Master incarnation she shows she's learned to break his control, and resist the effects of the Master's hallucinogenic sound weapon.\n In \"The Green Death\", the Doctor hypnotises Yates and, while doing so, accidentally mesmerises the Brigadier as well, who he wasn't targeting and who shouldn't have been looking.\n Sarah Jane Smith may be one of the Doctor's most independent companions, but she's also been hypnotised, brainwashed or possessed more often than any of them, starting from her very first appearance (in which she's mesmerised by Linx) and ending in her very last(in which she is possessed by Eldraad). Repeatedly lampshaded by both her and the Doctor, particularly in her leaving scene in \"The Hand of Fear\" when she complains about 'being hypnotised left, right and centre' as if bored by it. In \"Terror the Zygons\" the Doctor even uses hypnosis to save her life.\n Leela, justified as she was selectively bred to have no psychic ability. When the Doctor uses his Compelling Voice on a guard in \"The Sunmakers\", Leela gets mesmerised just by standing near him. She's also shown to be very powerfully affected by Minyan pacifier guns compared to the other characters we see get hit, getting completely loved-up and playing with strangers' hair (until the Doctor forces her to look into his eyes and tells her that she's an indomitable fearsome savage).\n Practically the gimmick of android companion Kamelion, who was controlled by the Master in both major appearances, eventually begging the Doctor for death after his possession in \"Planet of Fire\".\n Morgana in Merlin is easily hypnotized or entranced.\n Hicks from Alphas has a terrible track record when it comes to mind manipulation, starting in the first episode. In one episode he uses this to his advantage by having Nina brainwash him into believing he had switched sides. This gets progressively worse through the episode as he has his mind read (painfully), he gets talked into suicide by another Alpha, and then Nina talks him out of suicide by brainwashing him again into forgetting it.\n Buffy the Vampire Slayer:\n Played for laughs when Xander meets Dracula. Yes, that Dracula.\nXander: Okay. Let's do this. (assumes boxing stance) No poofing. Come on puffy shirt, pucker on up 'cause you can kiss your a... Dracula: Silence. Xander: Yes master.\n Kendra is effortlessly hypnotized by Drusilla while they were actually fighting; it's implied that her training and upbringing has left her with little ability to resist orders.\n\n    Tabletop Games \n The Will Save of Dungeons & Dragons 3rd Edition (and to a lesser extent, its descendant, Will Defense, inf 4th Edition) dictates whether or not a character is Weak-Willed. It's based on the Wisdom stat and a class may or may not get a bonus to it. This lead to classes that prioritized Wisdom and with a good bonus (Monk, Cleric, etc.) to being very strong willed, while classes that prioritizes other stats and gave no class bonus (Fighter and Rogue, especially) being almost legendarily prone to this trope. A very real possibility is for the party's Min-Maxed warrior to turn on the party's Squishy Wizard the moment an enemy cast Dominate Person. Barbarians actually get a bonus to Will Save while raging to try and prevent just such a scenario.\n The Star Wars d20 Roleplaying Game uses an identical mechanic — a character with a low Wisdom score is vunerable to a Jedi Mind Trick. Notably the rules state outright that Twi'lek's tend to be weaker-willed on average than humans (in game terms they have a Wisdom penalty). Hutts on the other hand have a Wisdom bonus reflecting their strong willpower.\n In GURPS, willpower is usually directly correlated to intelligence — so, to be \"naturally\" weak-willed would at first seem to require a low IQ. However, the Strong Will advantage and corresponding Weak Will disadvantage (both of which come in attribute-scale levels) then allow modifying this default further; it's thus entirely possible to have a character who's dumb (or just average) but stubborn or alternatively brilliant but a flake and mental pushover.\n Gargoyles in Vampire: The Masquerade, in addition to having taken a severe beating from the ugly stick, are more susceptible to mind control, from any source. It's a result of centuries of systematic will-breaking from their Tremere creators.\n Zigzagged in ''Warhammer 40,000', where it seems to depend as much on the strength of the victim as of the psyker. Ogryns are extremely stupid and often they're not so much hypnotized as told that their handlers have abandoned the Emperor, orks have high warp resistance, favored Khornate berserkers have collars that give them Magic Immunity, etc.\n\n    Toys \n Lewa from BIONICLE is not explicitly stated to be Weak-Willed, but he often finds himself the victim of things like Evil Masks and Puppeteer Parasites as part of a Running Gag. On at least one occasion, he has eventually managed to free himself through willpower (with a bit of help from his friends), so he could be considered a downplayed example.\n\n    Video Games \n Final Fantasy:\n Kain from Final Fantasy IV has built up a bad reputation due to the apparent ease his enemies have in brainwashing him to do evil. It actually only happened once — with a gap in the middle of the story where the signal was bad. Subverted in the end of the game, as evidenced by the \"Read the lead member's mind\" thing you can do in the DS version, where Zemus, the guy who controlled Golbez into mind-controlling Kain in the first place, so therefore better at mind control tries to control him again, this time by making him hate Rosa for choosing Cecil. He fights it off with ease.\n In Final Fantasy IV: The After Years, it's Cecil, not Kain, who gets brainwashed by the Mysterious Girl. You do end up fighting Kain as an enemy a lot in the base chapters, all the time claiming he's not being controlled this time. He isn't. It's actually his dark side, given form and teaming up with the Mysterious Girl, just so that he can kill Cecil.\n Cloud in Final Fantasy VII explains that the reason he was affected by Sephiroth's control of him through his Jenova cells is because he has a 'weak will' and thus 'got lost in the whole thing'. Strong-willed individuals, like Zack, can be injected with Jenova cells without any effect except boosted physical and magical abilities, and thus are selected to join SOLDIER. Weak-willed individuals, like Cloud and the rest of the Sephiroth Clones, go mad and lose their identities. On Cloud, helped along by pre-existing mental complexes, the effect was so bad that he cobbled together a complete and functional fake identity and set of memories for himself and ended up being lucid, if compared to the shambling, mumbling Clones (although The Mentally Disturbed by comparison to everyone else). Getting over his issues gives him the strength to shake off Sephiroth's mind control.\n Ryu from Street Fighter. Because of his drive to win at all costs and his hatred of losing, he is easily influenced by the Satsui No Hadou, in which it is only triggered by a burning desire to destroy the enemy and win no matter what.\n Willpower is an important solider stat in XCOM: Enemy Unknown. Soldiers with low Will are more likely to panic in battle, have lower resistance to psychic attacks, and are less likely to develop psychic abilities of their own. On the alien side, Mutons and Floaters have such poor Will that almost any psychic attack is guaranteed to work on them.\n\n    Web Comics \n In The Order of the Stick, Belkar has a habit of succumbing to almost any enemy that tries to mind-control him. This ties into the Dungeons & Dragons example above, as Belkar is a ranger/barbarian and both classes have poor Will saves. Additionally, Belkar has such a poor Wisdom score he can't even use the spells he should get as a ranger, making his Will saves even worse.\n\n    Web Original \n Played for Laughs in Suburban Knights after Film Brain gets controlled by The Cloaks. And then they break the control just by shaking him a bit and saying \"Snap out of it!\"\nTodd: Apparently they have power over the phenomenally weak-minded.\n The Nostalgia Critic has a rather worrying tendency to get manipulated and controlled really easily. For example, he would have done anything Sage as the Devil told him to do if it meant getting his mind erased of Sequel Month.\n Product Placement once made vegetarian Nostalgia Chick crave a burger. She can also be hypnotized pretty easily, as long as you don't mention Todd in the Shadows. Doesn't work then.\n\n    Western Animation \n Donald Duck in the DuckTales series' episode \"Spies on Their Eyes\".\n Gutsman from the Mega Man Animated Series.\n Homer on The Simpsons. One episode has him er... \"resist\" the most powerful mind control techniques of a commune, until they change the lyrics to the 1960's Batman score from \"Batman\" to \"Leader\".\n The Transformers Animated version of Wreck-Gar doesn't even need to be hypnotized first. If you tell him something, he will do it. If you tell him he is something, he will believe it whole-heartedly, until somebody else tells him he is something else. This is mitigated — somewhat — at the end of his first appearance... when it is suggested to him that he be less suggestible.\n Teen Titans:\n Beast Boy, as shown in the page pic. He isn't a total pushover, but for some reason is really suggestible to Mad Mod's swirly TV screens. Must be because he is the dullest of the five, as well as some deep-rooted inferiority issues due to his relationship with his father figure, Mento. Or possibly just because they're on TV screens.\n His one-time girlfriend Terra too, who relies on others to make choices for her, even if it's the evil Slade. Appropriately enough, Beast Boy manages to man up himself and get her to strengthen her willpower too, which leads to her redemption.\n Sam from Totally Spies! is mind-controlled inordinately often. In comparison, vain Clover ends up dealing with some sort of Body Horror.\n Rocky and Bullwinkle: Bullwinkle is generally Too Dumb to Fool, but he is once put under the control of \"The World's Greatest Hypnotist\" by a snap of the fingers. The best part? Said hypnotist is the villain in disguise, who has no hypnotic powers or skills of any kind.\n The Secret Show: Wanting to be called back into active duty, retired U.Z.Z. Agent Zach Meadows impersonated Dr. Hypno, a criminal from his days who hypnotized his actually her, but that wasn't revealed until the end of the episode where they appeared victims and he was the only one who managed to defeat her. Once he was exposed, he explained he could only affect people with low intelligence, which explains only Victor being affected. Unfortunately, the real Dr. Hypno didn't like being impersonated and came back from retirement to settle a score with the imposter.\n\n\n",
    "title": "Weak-Willed - TV Tropes"
}
}